Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-38-42.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་ལུམ་བི་ནིའི་ནགས་ཚལ་དུ་བྱུང་བ་ལྔ་པའོ། །རིགས་ཀྱི་བུ་གཞན་ཡང་བཅོམ་ལྡན་འདས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཛད་པའི་ཚེ།
en: “Noble one, that was the fifth miraculous manifestation at the birth of the bodhisattva that appeared in the Lumbinī Forest.

source: གཏང་བར་དཀའ་བ་ཡོངས་སུ་བཏང་སྟེ།
en: “Moreover, noble one, there appeared in all the pores of Māyādevī’s body images of when the Bhagavat was practicing bodhisattva conduct in the past and gave away that which was difficult to give.

source: ཞབས་དང་ཕྱག་ཡོངས་སུ་བཏང་བའམ།
en: He gave away his legs and arms.

source: སྙན་དང་ཤངས་ཡོངས་སུ་བཏང་བའམ།
en: He gave away his ears and nose.

source: ལྗགས་དང་ཚེམས་ཡོངས་སུ་བཏང་བའམ།
en: He gave away his tongue and teeth.

source: སྤྱན་དང་དབུ་ཡོངས་སུ་བཏང་བའམ།
en: He gave away his eyes and head.

source: ཤ་དང་ཁྲག་ཡོངས་སུ་བཏང་བའམ།
en: He gave away his flesh and blood.

source: རུས་པ་དང་རྐང་ཡོངས་སུ་བཏང་བའམ།
en: He gave away his bones and marrow.

source: མཁལ་མ་དང་ཐུགས་ཡོངས་སུ་བཏང་བའམ།
en: He gave away his kidneys and heart.

source: པགས་པ་དང་ཕྲི་ཡོངས་སུ་བཏང་བའམ།
en: He gave away his skin and subcutaneous tissue.

source: ཕྱི་ནང་གི་དངོས་པོ་ཡོངས་སུ་བཏང་བའམ།
en: He gave away all his outer and inner things.

source: སྲས་པོ་དང་སྲས་མོ་དང་བཙུན་མོ་ཡོངས་སུ་བཏང་བའམ།
en: He gave away his sons, daughters, and wives.

source: སྐུ་ཡོངས་སུ་བཏང་བའམ།
en: He gave away his body.

source: ལོངས་སྤྱོད་རིན་པོ་ཆེ་ཡོངས་སུ་བཏང་བའམ།
en: He gave away his precious possessions.

source: གྲོང་དང་གྲོང་ཁྱེར་དང་ལྗོངས་དང་། ཡུལ་དང་ཁམས་དང་། རྒྱལ་པོའི་གནས་ཡོངས་སུ་བཏང་བའམ།
en: He gave away his villages and towns. He gave away his regions and realms. He gave away his royal capital.

source: ནོར་དང་འབྲུ་དང་མཛོད་དང་བང་བ་ཡོངས་སུ་བཏང་བའམ།
en: He gave away his wealth, grain, treasures, and storehouses.

source: ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻཌཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། གསེར་དང་། དངུལ་ཡོངས་སུ་བཏང་བའམ།
en: He gave away his jewels, pearls, beryls, conches, crystals, corals, gold, and silver.

source: རིན་པོ་ཆེའི་རྒྱན་སྣ་ཚོགས་ཡོངས་སུ་བཏང་བའམ།
en: He gave away his various precious adornments.

source: མལ་ཆ་ཡོངས་སུ་བཏང་བའམ།
en: He gave away his beds and seats.

source: ཁང་པ་དང་གཞལ་མེད་ཁང་ཡོངས་སུ་བཏང་བའམ།
en: He gave away his houses and palaces.

source: ཡོ་བྱད་ཡོངས་སུ་བཏང་བའམ།
en: He gave away all his possessions.

source: དེ་ལྟར་གཏོང་བའི་བྱང་ཆུབ་སེམས་དཔའི་སྐུ་གཟུགས་དང་། རྣམ་པ་ཇི་ལྟ་བུར་ཡོངས་སུ་བཏང་བར་གྱུར་པ་དང་། ལེན་པ་དེ་དག་ཀྱང་རྣམ་པ་ཇི་ལྟུ་བུས་ལེན་པར་གྱུར་པ་དང་། སྦྱིན་པའི་དངོས་པོ་རྣམ་པ་ཇི་ལྟ་བུ་དག་ཡོངས་སུ་བཏང་བར་གྱུར་པ་དང་། ཡུལ་གྱི་ཕྱོགས་གང་དག་ཏུ་ཡོངས་སུ་བཏང་བར་གྱུར་པ་དང་། དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དུ་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། ལྷ་མོ་སྒྱུ་མའི་བ་སྤུའི་སྒོ་ཐམས་ཅད་ལས་གཟུགས་བརྙན་དུ་སྣང་བར་གྱུར་ཏོ། །སློངས་མོ་བའི་སྒྲ་དེ་དག་ཀྱང་གྲག་པར་གྱུར་ཏེ།
en: There appeared the physical forms of the bodhisattva and the way in which he gave, the appearance of those who acquired what he gave away, the appearance of the things that he gave away, the places where he gave them away, and all who were at that time in the entourage of the bodhisattva.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་ལུམ་བི་ནིའི་ནགས་ཚལ་དུ་བྱུང་བ་དྲུག་པའོ།
en: “Noble one, that was the sixth miraculous manifestation at the birth of the bodhisattva that appeared in the Lumbinī Forest.

source: །རིགས་ཀྱི་བུ་གཞན་ཡང་སྔོན་གྱི་མཐའི་རྒྱུད་དུ་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཡུམ་གྱི་སྐུ་ནས་བལྟམས་པར་གྱུར་པའི་ཚེ།
en: “Moreover, noble one, when it was time for the succession of tathāgatas in the past to be born from their mother’s body, there appeared all the arrays and adornments of buddha realms;

source: སངས་རྒྱས་ཀྱི་ཞིང་གི་རྒྱན་དང་། ལྷབ་ལྷུབ་ཇི་སྙེད་ཅིག་བྱུང་བར་གྱུར་པ་དང་། སེམས་ཅན་གྱི་རྒྱན་རྣམ་པར་ཕྱེ་བ་དང་། བཟའ་ཤིང་གི་རྒྱན་རྣམ་པར་ཕྱེ་བ་དང་། མེ་ཏོག་དང་བདུག་པ་དང་། སྤོས་དང་ཕྲེང་བ་དང་བྱུག་པ་དང་ཕྱེ་མ་དང་། ན་བཟའ་དང་གདུགས་དང་རྒྱལ་མཚན་དང་། བ་དན་གྱི་རྒྱན་རྣམ་པར་ཕྱེ་བ་དང་། རིན་པོ་ཆེའི་རྒྱལ་པོ་ཐམས་ཅད་རྣམ་པར་འཕྲུལ་པའི་རྒྱན་རྣམ་པར་ཕྱེ་བ་དང་། རོལ་མོ་དང་གླུ་དང་། བསྟོད་པ་དང་། སིལ་སྙན་གྱི་སྒྲ་ཇི་སྙེད་ཅིག་བྱུང་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་།
en: the arrays of adorning beings; the arrays of adorning trees; the arrays of flowers, perfumes, incenses, garlands, ointments, powders, clothing, banners, and flags; the various miraculous manifestations of arrays of all precious jewels; and music, song, praises, and the sound of musical instruments.

source: ལྷ་མོ་སྒྱུ་མ་ལུམ་བི་ནིའི་ནགས་ཚལ་དུ་ཕྱིན་པའི་ཚེ། ལུམ་བི་ནིའི་ནགས་ཚལ་འདིར་ཡོངས་སུ་བྱུང་བར་གྱུར་ཏོ། །མངོན་པར་སྐྱེས་སོ། །འགྲོ་བས་རྣམ་པར་དམྱིགས་སུ་ཡོད་པར་བྱུང་བར་གྱུར་ཏེ།
en: When Māyādevī came to the Lumbinī Forest, all of those arose, appeared, and were perceived by beings in the Lumbinī Forest.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་ལུམ་བི་ནིའི་ནགས་ཚལ་དུ་བྱུང་བ་བདུན་པའོ།
en: “Noble one, that was the seventh miraculous manifestation at the birth of the bodhisattva that appeared in the Lumbinī Forest.

source: །རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ལོངས་སྤྱོད་ལྷའི་དབང་པོ་ཐམས་ཅད་ཀྱི་གནས་ཀྱི་རྒྱན་གྱི་ལོངས་སྤྱོད་ལས་ཡོངས་སུ་འདས་པ་དང་། ཀླུ་དང་གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མིའི་དབང་པོ་ཐམས་ཅད་ཀྱི་གནས་ཀྱི་རྒྱན་གྱི་ལོངས་སྤྱོད་ལས་འདས་པ་འདི་ལྟེ་སྟེ། རིན་པོ་ཆེའི་རྒྱལ་པོ་ཐམས་ཅད་ཀྱི་ཁང་པ་བརྩེགས་པའི་ལོངས་སྤྱོད་དམ། རིན་པོ་ཆེའི་རྒྱལ་པོའི་གཞལ་མེད་ཁང་གི་ལོངས་སྤྱོད་དམ། རིན་པོ་ཆེའི་རྒྱལ་པོའི་དྲ་བའི་ལོངས་སྤྱོད་དམ། རིན་པོ་ཆེའི་རྒྱལ་པོའི་འབྲུའི་ལོངས་སྤྱོད་དམ། རིན་པོ་ཆེའི་རྒྱལ་པོའི་གཟུགས་ཀྱི་ལོངས་སྤྱོད་དམ། རིན་པོ་ཆེའི་རྒྱན་ཐམས་ཅད་ཀྱི་ལོངས་སྤྱོད་དམ། སྤོས་ཀྱི་རྒྱལ་པོ་ཐམས་ཅད་ཀྱི་ལོངས་སྤྱོད་དམ། དམྱིགས་པ་ཐམས་ཅད་བཟང་ཞིང་འཐུན་པའི་ལོངས་སྤྱོད་ཀྱང་རུང་སྟེ། དེ་དག་ཐམས་ཅད་ལྷ་མོ་སྒྱུ་མའི་རུམ་ནས་མ་འདྲེས་པར་འཐོན་ཏེ། ལུམ་བི་ནིའི་ནགས་ཚལ་འདི་ཡོངས་སུ་བརྒྱན་ཅིང་ཀུན་ནས་གནས་པར་གྱུར་ཏེ།
en: “Moreover, noble one, all that is enjoyed by bodhisattvas, which are the enjoyment of kūṭāgāras made of all kings of jewels, the enjoyment of divine palaces made of kings of jewels, the enjoyment of nets of kings of jewels, the enjoyment of objects made of kings of jewels, the enjoyment of statues made of kings of jewels, the enjoyment of displays of kings of jewels, the enjoyment of all adornments, the enjoyment of all kings of perfume, the enjoyment of all perceptions that are beautiful and pleasing, which transcend the enjoyment of the displays in the residences of all lords of devas and transcend the enjoyment of the displays in the residences of all nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, and lords of humans, were all emanated, unmixed with one another, from the womb of Māyādevī and were present and arrayed everywhere in the Lumbinī Forest.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བ་རྣམ་པར་འཕྲུལ་པ་ལུམ་བི་ནིའི་ནགས་ཚལ་དུ་བྱུང་བ་བརྒྱད་པའོ།
en: “Noble one, that was the eighth miraculous manifestation at the birth of the bodhisattva that appeared in the Lumbinī Forest.

source: །རིགས་ཀྱི་བུ་གཞན་ཡང་ལྷ་མོ་སྒྱུ་མའི་ལུས་ལས་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་དང་། སྐུ་གཟུགས་དང་སྐུ་མདོག་དང་། དབྱིབས་འདྲ་བ་མཚན་དང་དཔེ་བྱད་བཟང་པོའི་རྒྱན་གྱིས་འདྲ་བར་བརྒྱན་པ་དང་། འོད་འདྲ་བ་དང་། འོད་ཟེར་འདྲ་བ་རབ་ཏུ་འགྱེད་པ། ཚུལ་དང་འགྲོས་སྟབས་འདྲ་བ། རྩལ་དང་མཐུ་འདྲ་བ། རྣམ་པར་སྣང་བའི་རྣམ་པར་འཕྲུལ་བ་འཐུན་པ། འཁོར་འདྲ་བ། རྒྱན་མཚུངས་པ་མང་པོ་ཡང་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་ལེགས་པ་རྒྱ་མཚོ་ཡོངས་སུ་བརྗོད་ཅིང་འཐུན་པར་གྱུར་ཏེ།
en: “Moreover, noble one, from the body of Māyādevī emanated bodhisattvas, as numerous as the atoms in countless quintillions of buddha realms, who had the same body, color, and shape as the Bhagavat Vairocana, the same adornment of the signs and features of a great being, the same aura, the same radiating of light rays, the same way of moving, the same prowess, the same illuminating miraculous manifestations, the same following, and the same displays, and they praised and resembled the ocean of Bhagavat Vairocana’s excellences.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་ལུམ་བི་ནིའི་ནགས་ཚལ་དུ་བྱུང་བ་དགུ་བའོ།
en: “Noble one, that was the ninth miraculous manifestation at the birth of the bodhisattva that appeared in the Lumbinī Forest.

source: །རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་བལྟམ་པར་གྱུར་པའི་དུས་ལ་བབ་པ་དང་། ལྷ་མོ་སྒྱུ་མའི་མདུན་དུ་འོག་གི་རྡོ་རྗེའི་གཞི་ལས་ས་ཆེན་པོ་མངོན་པར་བརྟོལ་ཏེ། རིན་པོ་ཆེའི་རྒྱལ་པོ་པདྨོ་ཆེན་པོ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་རྒྱན་གྱི་དམ་པ་ཞེས་བྱང་ཆུབ་རིན་པོ་ཆེའི་རྒྱལ་པོ་གཞན་གྱིས་མི་ཐུབ་པའི་རྡོ་རྗེ་ཆེན་པོ་ལས་གྲུབ་པ།
en: “Moreover, noble one, the time having come for the birth of the bodhisattva, in front of Māyādevī there rose up from the vajra ground below, breaking through the great earth, a great lotus made of the kings of jewels called an essence that is a display of all jewels

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་འགྲོ་བ་རྒྱ་མཚོའི་ནང་རིམ་དང་ལྡན་པ། ཟེ་བའི་རྩེ་མོ་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། འདབ་མའི་ཕྲེང་བ་སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་བརྒྱན་ཅིང་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ།
en: Its essence comprised the king of jewels, the great indestructible vajra. All kings of jewels adorned the tips of its filaments. It was adorned by rows of circles of petals as numerous as the atoms in ten buddha realms.

source: ལོ་མའི་དཀྱིལ་འཁོར་རིན་པོ་ཆེའི་རྒྱལ་པོ་སྣ་ཚོགས་ཀྱིས་བྱས་པ།
en: Its surrounding leaves were made of various kings of jewels.

source: སྙིང་པོ་མཛེས་པ་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱིས་རྣམ་པར་དག་པ་དང་ལྡན་པ།
en: Its beautiful pericarp was composed of pure wish-fulfilling jewels.

source: ཟེ་བའི་ཕྲེང་བ་རྣམ་པར་ཕྱེ་བ་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཁ་དོག་ཚད་མེད་པ་དང་ལྡན་པ།
en: It had an array of circles of filaments that had the countless colors of all jewels.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་གྲངས་མེད་པའི་དྲ་བའི་རྒྱན་དང་ལྡན་པས་ཡོངས་སུ་ཡོག་པ།
en: An adorning net of countless precious kings of jewels enveloped it.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་རྡོ་རྗེ་མཐུ་བོ་ཆེས་མི་ཤིགས་པས་ལྷུན་ཀུན་ནས་བཀབ་པ།
en: It was covered by a mass of indestructible, powerful, vajra kings of jewels.

source: ལྷའི་རིས་ཐམས་ཅད་ཀྱིས་ཀུན་ནས་བསྐོར་བ།
en: “All the lords of the devas encircled it.

source: ཀླུའི་དབང་པོ་ཐམས་ཅད་ཀྱིས་སྤོས་ཆུའི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ།
en: All the lords of the nāgas sent down rain from clouds of scented water.

source: གནོད་སྦྱིན་གྱི་དབང་པོ་ཐམས་ཅད་ཀྱིས་ཀུན་ནས་བསྐོར་ཅིང་ལྷ་རྫས་ཀྱི་མེ་ཏོག་སྙིམ་པ་ནས་གཏོར་བ།
en: All the lords of the yakṣas encircling it cast down handfuls of divine flowers.

source: དྲི་ཟའི་དབང་པོ་ཐམས་ཅད་ཀྱིས་སྔོན་གྱི་སངས་རྒྱས་ལ་རིམ་གྲོར་བྱས་པའི་གླུའི་དབྱངས་སྙན་ཅིང་ཡིད་དུ་འོང་བའི་ང་རོ་དང་སྦྱར་ཏེ་བསྟོད་པའི་སྤྲིན་གྱིས་མངོན་པར་བསྟོད་པ།
en: All the lords of the gandharvas sang clouds of praises to it that had a beautiful sound of melodious songs that had honored the buddhas of the past.

source: ལྷ་མ་ཡིན་གྱི་དབང་པོ་ཐམས་ཅད་ཀྱིས་ང་རྒྱལ་དང་རློམ་པ་དང་། དྲེགས་པ་ཐམས་ཅད་བཏང་ཞིང་ཤིན་ཏུ་བཏུད་དེ་ཕྱག་བྱ་བ།
en: All the lords of asuras, forsaking all pride, arrogance, and haughtiness, bowed down and paid homage.

source: ནམ་མཁའ་ལྡིང་གི་དབང་པོ་ཐམས་ཅད་ཀྱིས་རིན་པོ་ཆེའི་སྣམ་བུ་ཀུན་ཏུ་སྤྱངས་ཏེ། ནམ་མཁའ་ཀུན་ནས་བརྒྱན་པར་བྱ་བ། མི་འམ་ཅིའི་དབང་པོ་ཐམས་ཅད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ཡོངས་སུ་བརྗོད་ཅིང་རོལ་མོ་དང་གླུའི་དབྱངས་ལ་བརྩོན་པ་དང་། ཉམས་རབ་ཏུ་བདེ་བས་ཀུན་ནས་བལྟ་བ།
en: All the lords of the garuḍas hung precious cloths that adorned the entire sky. All the lords of the kinnaras gazed upon it while engaged in describing with delight the qualities of bodhisattvas with song and music.

source: ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོ་ཐམས་ཅད་ཀྱིས་ཤིན་ཏུ་དགའ་བ་དང་། མོས་པ་སྐྱེས་པས་ཡོངས་སུ་བལྟ་ཞིང་སྒྲ་སྙན་པ་ཕྱུང་སྟེ། རྒྱན་གྱི་སྤྲིན་ཐམས་ཅད་ཀྱི་ཆར་མངོན་པར་དབབ་པ་བྱུང་བར་གྱུར་ཏེ།
en: All the lords of the mahoragas, gazing upon it with great joy and faith, were engaged in emitting beautiful sounds and sending down rain from clouds of every kind of display.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་ལུམ་བི་ནིའི་ནགས་ཚལ་དུ་བྱུང་བ་བཅུ་པའོ།
en: “Noble one, that was the tenth miraculous manifestation at the birth of the bodhisattva that appeared in the Lumbinī Forest.

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་བཅུ་པོ་དེ་དག་ལུམ་བི་ནིའི་ནགས་ཚལ་དུ་བྱུང་བར་གྱུར་ནས།
en: “Noble one, those ten miraculous manifestations at the time of the bodhisattva’s birth occurred in the Lumbinī Forest.

source: དེའི་རྗེས་ལ་བྱང་ཆུབ་སེམས་དཔའ་འོད་ཚད་མེད་བསམ་གྱིས་མི་ཁྱབ་པ་མངའ་བ། བལྟ་ན་གཏང་མྱི་བྲ་བ་ཞིག་ལྷ་མོ་སྒྱུ་མའི་རུམ་ནས་བལྟམ་སྟེ། ནམ་མཁའི་དབྱིངས་རུམ་ནས་ཉི་མའི་དཀྱིལ་འཁོར་ཤར་བ་ལྟ། སྤྲིན་གྱི་ཚོགས་རུམ་ནས་གློག་གི་ཕྲེང་བ་འགྱུ་བ་ལྟ། རི་ཆེན་པོའི་སྤོ་རུམ་ནས་ཉི་མ་ཤར་ཀའི་སྤྲིན་ཀོ་ལྟ།
en: “After that, the bodhisattva, who possessed inconceivable, measureless light that could not be looked at, was born from Māyādevī’s womb, like the disk of the sun from the surface of the sky, like lightning flashing from clouds, like the dawn clouds rising from behind a mountain peak, like a great lamp from a deep darkness.

source: མུན་པ་སྟུག་རུམ་ནས་སྒྲོན་མ་ཆེན་པོ་བྱུང་བ་ལྟ་སྟེ། མངོན་པར་བལྟམ་པར་གྱུར་ཏོ། །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ལྷ་མོ་སྒྱུ་མའི་ལུས་ལས་གཟུགས་བརྙན་ལྟར་བསྟན་པའི་ཆོས་ཉིད་དང་། རྨི་ལམ་ལྟར་བསྟན་པའི་ཆོས་ཉིད་དང་། སྒྱུ་མའི་རྣམ་པའི་གཟུགས་རྣམ་པར་དམྱིགས་པ་ལྟར་བསྟན་པའི་ཆོས་ཉིད་དང་། འགྲོ་བ་དང་འོང་བ་མྱེད་པའི་ཆོས་ཉིད་དང་། སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པའི་འོད་རྣམ་པར་དམྱིགས་པ་ཡོངས་སུ་བསྟན་པའི་ཆོས་ཉིད་ཀྱིས་མངོན་པར་འབྱུང་བ་ཡོངས་སུ་བསྟན་ཏོ།
en: “In that way, the bodhisattva emerged from the body of Māyādevī, manifesting in the nature of reflection, manifesting in the nature of a dream, manifesting in the nature of perceiving a form that is a conjured illusion, having the nature of being without coming or going, having the nature of a manifestation of the perception of a light that has no birth or cessation.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་ནི་ལུམ་བུ་ནིའི་ནགས་ཚལ་འདི་ན་གནས་ཤིང་། བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྐུ་ཚེའི་རྣམ་པར་འཕྲུལ་པ་རྒྱ་མཚོ་ལ་ལྟ་ཞིང་ཁོང་དུ་ཆུད་པར་བྱེད་དེ།
en: “Noble one, in that way, while residing in this Lumbinī Forest, I see and comprehend the ocean of the miraculous manifestations at the birth of the Bhagavat Vairocana.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་གླིང་བཞི་པ་སྐལ་བ་དང་ལྡན་པ་འདི་ལ་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྐུ་ཚེའི་རྣམ་པར་འཕྲུལ་པ་ལ་ལྟ་ཞིང་ཁོང་དུ་ཆུད་པར་བྱ་བར་གནས་པ་དེ་བཞིན་དུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་གླིང་བཞི་པ་ཐམས་ཅད་ཀྱི་འཛམ་བུའི་གླིང་བྱེ་བ་ཕྲག་བརྒྱ་ཐམས་ཅད་ནའང་། བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་སྐུ་ཚེའི་རྣམ་པར་འཕྲུལ་པ་བྱེ་བ་ཕྲག་བརྒྱ་ལ་ལྟ་ཞིང་ཁོང་དུ་ཆུད་པར་བྱེད་དོ།
en: “And, noble one, just as I see and comprehend the ocean of the miraculous manifestations at the birth of the Bhagavat Vairocana in this four-continent world, in that same way I see and comprehend a thousand million miraculous manifestations at the birth of the Bhagavat Vairocana in the thousand million Jambudvīpas in all the four-continent worlds in this world realm of a thousand million worlds.

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་འདུས་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའི་ཁོངས་སུ་ཆུད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ལ་འཇུག་པའི་ཡེ་ཤེས་ཀྱིས་ཁོང་དུ་ཆུད་པ་དག་ཏུ་ཡང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་སེམས་ཀྱིས་ཁོང་དུ་ཆུད་པར་བྱ་བ་རེ་རེས་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྐུ་ཚེའི་རྣམ་པར་འཕྲུལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལ་ལྟཞིང་ཁོང་དུ་ཆུད་པར་བྱེད་དོ།
en: “Just as I see and comprehend the miraculous manifestations of the birth of the Bhagavat Vairocana in a thousand million Jambudvīpas in all the four-continent worlds in this world realm of a thousand million worlds, in the same way, I comprehend the miraculous manifestations at the birth of the Bhagavat Vairocana that are as numerous as the atoms in a buddha realm with each instant of mind, with the penetration of the mind, in all the atoms contained within an entire world realm of a thousand million worlds, known by the knowledge that enters into the atoms of all buddha realms.

source: །དེའི་འོག་མའི་སེམས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རྣམས་ཁོངས་སུ་ཆུད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ལས་སངས་རྒྱས་ཀྱི་ཞིང་རེ་རེར་ཡང་དེ་དང་མཉམ་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་ལ་ལྟ་ཞིང་ཁོང་དུ་ཆུད་པར་བྱེད་དེ།
en: “In the next mentation, I see and comprehend equally the miraculous manifestations at the birth of bodhisattvas within each of the buddha realms contained within the atoms of a buddha realm.

source: ཚུལ་དེ་ལྟ་བུས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའི་ཁོངས་སུ་ཆུད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་རེ་རེ་དག་ཏུ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་ལ་ལྟ་ཞིང་། ཁོང་དུ་ཆུད་པར་བྱེད་ཀྱང་། རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཐམས་ཅད་ཀྱི་རྡུལ་རེ་རེ་ལ་ཞིང་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པའི་མཐའ་རྙེད་པར་མ་རུང་ངོ་། །ཞིང་ཐམས་ཅད་ཀྱི་ཞིང་རེ་རེར་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཡང་མུ་རྙེད་པར་མ་རུང་ངོ་།
en: “In that way, although I see and comprehend the miraculous manifestations at the births of bodhisattvas in each of the buddha realms contained within the atoms of all buddha realms, there is no knowable end to the succession of realms in each one of all the atoms, and there is no knowable end to the succession of births of bodhisattvas in each one of all the realms.

source: །ཇི་ལྟར་ཁོ་མོ་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བ་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་ལ་ལྟ་ཞིང་ཁོང་དུ་ཆུད་པར་བྱེད་པ། དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་དང་དབུས་མེད་པ་དང་། རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཐམས་ཅད་ལའང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེའི་སེམས་ཀྱི་ཁོང་དུ་ཆུད་པར་བྱ་བ་རེ་རེ་ལ། བྱིན་གྱི་རླབས་རྒྱུན་མི་ཆད་པའི་ཚུལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་བ་ཐམས་ཅད་ལ་ལྟ་ཞིང་ཁོང་དུ་ཆུད་པར་བྱེད་དོ།
en: “Just as I see and comprehend all the miraculous manifestations at the birth of bodhisattvas in this world realm, in the same way, in each instant of mind, with the penetration of the mind, through continuous spiritual power, I see and comprehend all the miraculous manifestations at the births of bodhisattvas in all the vast extent of world realms, without end or middle, in the ten directions and in all atoms.”

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ལུམ་བི་ནིའི་ནགས་ཚལ་གྱི་ལྷ་མོ་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་བཟང་པོས་དགའ་བའི་དཔལ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་བསྐལ་པ་ཚད་མྱེད་པར་དམིགས་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་སྟོན་པ་འདི་རྙེད་ནས་ཡུན་ཇི་སྲིད་ཅིག་ལགས། སྨྲས་པ།
en: Sudhana, the head merchant’s son, asked Sutejomaṇḍala­rati­śrī, the Lumbinī Forest goddess, “Āryā, how long has it been since you attained this bodhisattva liberation called the miraculous manifestations at the birth of bodhisattvas throughout all the perceptions of countless kalpas

source: རིགས་ཀྱི་བུ་སྔོན་འདས་པའི་དུས་བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་འདས་པའི་ཕ་རོལ་དེའི་ཡང་ཕ་སྔ་ཞིག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་ཀུན་ནས་རིན་པོ་ཆེ་ཞེས་བྱ་བར་བསྐལ་པ་མཉམ་པར་གཞག་པ་ཞེས་བྱ་བ་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་བརྒྱད་ཅུ་བྱུང་བ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དབང་ཕྱུག་གི་ཡོན་ཏན་གཞན་གྱིས་མི་ཐུབ་པའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་མཁྱེན་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ་བླ་ན་མེད་པ་སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་བསྒྱུར་བ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་ངོ་།
en: She answered, “Noble one, in the past, in times gone by, beyond as many kalpas as there are atoms in ten million buddha realms, and even further beyond, there was a world realm called Samanta­ratnā in a kalpa called Samāpadyata in which appeared eighty quintillion buddhas. There appeared in that world the Tathāgata Arhat Samyak­saṃbuddha Īśvara­guṇāparājita­dhvaja, who was one with wisdom and conduct, a sugata, one who knows the world’s beings, an unsurpassable guide who tames beings, a teacher of devas and humans, a buddha, and a bhagavat.

source: །རིགས་ཀྱི་བུ་འཇིག་རྟེན་གྱི་ཁམས་ཀུན་ནས་རིན་པོ་ཆེ་ཞེས་བྱ་བ་དེར་གླིང་བཞི་བ་དབུ་མ་རྒྱན་སྣ་ཚོགས་ཀྱི་འོད་ཅེས་བྱ་བ་བྱུང་སྟེ།
en: “Noble one, at the center of the world realm called Samanta­ratnā, there was a four-continent world called Vicitra­vyūha­prabhā.

source: གླིང་བཞི་པ་དེའི་འཛམ་བུའི་གླིང་གི་དབུས་སུ་རྒྱལ་པོའི་གནས་རི་རབ་རྣམ་པར་དག་པའི་རྒྱན་གྱི་རྒྱལ་མཚན་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: In the middle of the Jambudvīpa of that four-continent world there was a royal capital called Meru­viśuddha­vyūha­dhvajā.

source: རྒྱལ་པོའི་གནས་དེར་རྒྱལ་པོ་རིན་པོ་ཆེ་འོད་འཕྲོ་བའི་མིག་གི་འོད་ཅེས་བྱ་བ་བྱུང་ངོ་།
en: In that royal capital there was King Ratnārci­netra­prabha.

source: །རྒྱལ་པོ་རིན་པོ་ཆེའི་འོད་འཕྲོ་བའི་མིག་གི་འོད་དེ་ལ་བཙུན་མོ་རབ་ཏུ་དགའ་བའི་འོད་ལ་དབང་བསྒྱུར་བ་ཞེས་བྱ་བ་མངའོ།
en: King Ratnārci­netra­prabha had a queen called Suharṣita­prabheśvarā.

source: །རིགས་ཀྱི་བུ་དཔེར་ན། གླིང་བཞི་པ་སྐལ་བ་དང་ལྡན་པ་འདིའི་འཛམ་བུའི་གླིང་དུ་ལྷ་མོ་སྒྱུ་མ་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་ཡུམ་དུ་གྱུར་པ་དེ་བཞིན་དུ་དེའི་ཚེ། དེའི་དུས་ན་གླིང་བཞི་པ་རྒྱན་སྣ་ཚོགས་ཀྱི་འོད་ཀྱི་འཛམ་བུའི་གླིང་དུའང་རབ་ཏུ་དགའ་བའི་འོད་ལ་དབང་བསྒྱུར་བ་ཞེས་བྱ་བ་ཡང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དབང་ཕྱུག་གི་ཡོན་ཏན་གཞན་གྱིས་མི་ཐུབ་པའི་རྒྱལ་མཚན་གྱི་ཡུམ་དུ་གྱུར་ཏེ།
en: “Noble one, just as Māyādevī became the mother of the Bhagavat Vairocana in this four-continent world, at that time, in that time, Queen Suharṣita­prabheśvarā became the mother of the Bhagavat, the Tathāgata Īśvara­guṇāparājita­dhvaja, in the four-continent world called Vicitra­vyūha­prabhā.

source: སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་བརྒྱད་ཅུ་བསྐལ་པའི་དང་པོ་ལ་བྱུང་སྟེ།
en: He was the first of the eighty quintillion buddhas.

source: ཐོག་མར་བྱུང་བའི་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དབང་ཕྱུག་གི་ཡོན་ཏན་གཞན་གྱིས་མི་ཐུབ་པའི་རྒྱལ་མཚན་གྱི་ཡུམ་དུ་གྱུར་ཏོ།
en: She was the mother of the first bhagavat to appear, the Tathāgata Īśvara­guṇāparājita­dhvaja.

source: །རིགས་ཀྱི་བུ་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་འོད་ལ་དབང་བསྒྱུར་བ་དེ་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བའི་དུས་ལ་བབ་པ་དང་། བུད་མེད་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་ཉི་ཤུ་དང་ལྷན་ཅིག་ཏུ་བཟའ་ཤིང་གི་ར་བ་ཆེན་པོ་འོད་ཀྱི་དཀྱིལ་འཁོར་གསེར་གྱི་མེ་ཏོག་ཅེས་བྱ་བ་དེར་ཕྱིན་ཏེ།
en: “Noble one, when the time had come for the birth of the bodhisattva, Queen Suharṣita­prabheśvarā, together with two hundred thousand trillion women, went to the great park called Suvarṇa­puṣpābha­maṇḍala.

source: དབང་ཕྱུག་གི་ཡོན་ཏན་གཞན་གྱིས་མི་ཐུབ་པའི་རྒྱལ་མཚན་གཞོན་ནུ་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པས་དེ་ལྟར་བལྟམ་མོ།
en: Prince Īśvara­guṇāparājita­dhvaja was born there with the inconceivable miraculous manifestations that occur at the birth of a bodhisattva.

source: དེའི་ཚེ་བཟའ་ཤིང་གི་ར་བ་ཆེན་པོའི་འོད་ཀྱི་དཀྱིལ་འཁོར་གསེར་གྱི་མེ་ཏོག་ཅེས་བྱ་བ་དེའི་དབུས་སུ་ཕོ་བྲང་བརྩེགས་པ་རིན་པོ་ཆེ་སྣ་ཚོགས་བཟང་པོ་ལས་བརྩེགས་པ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “At that time, there appeared in the center of the great park called Suvarṇa­puṣpābha­maṇḍala a kūṭāgāra called Subha­ratna­vicitra­kūṭa.

source: ཕོ་བྲང་བརྩེགས་པ་དེའི་ནང་དུ་ཤིང་འདོད་པ་ཐམས་ཅད་འབྱིན་པའི་ཡལ་ག་ལ་འཇུ་སྟེ། ལྷ་མོ་རབ་ཏུ་དགའ་བའི་འོད་ལ་དབང་བསྒྱུར་བ་ལས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དབང་ཕྱུག་གི་ཡོན་ཏན་གཞན་གྱིས་མི་ཐུབ་པའི་རྒྱལ་མཚན་བལྟམ་མོ།
en: The Bhagavat, the Tathāgata Īśvara­guṇāparājita­dhvaja was born from Queen Suharṣita­prabheśvarā as she held on to a branch of a wish-fulfilling tree inside that kūṭāgāra.

source: །དེའི་ཚེ་བཅོམ་ལྡན་འདས་དེ་བལྟམ་ཁར།
en: “At that time, when the Bhagavat was born, the nurse Vimala­saṃbhava­prabhā was in attendance.

source: མ་མ་དྲི་མ་མེད་པ་སྐྱེད་པའི་འོད་ཅེས་བྱ་བ་སྟ་གོན་དུ་གནས་གནས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་བལྟམ་པར་གྱུར་མ་ཐག་ཏུ་འཇིག་རྟེན་གྱི་དབང་པོ་རྣམས་ཀྱིས་སྤོས་དྲི་ཤིན་ཏུ་ཞིམ་པའི་སྤོས་ཆུའི་བུམ་པ། མེ་ཏོག་དྲི་ཞིམ་ཞིང་ཡིད་དུ་འོང་བ་སྣ་ཚོགས་མངོན་པར་འཐོར་བས་སྐུ་བསིལ་ཏེ།
en: As soon as the bodhisattva was born, the lords of the world sprinkled him with a vase of scented water that was wonderfully aromatic and with a variety of beautiful flowers so as to cool his body.

source: དེ་ལ་ཚུལ་དང་མཐུན་པའི་མཆོད་པ་བསམ་གྱིས་མི་ཁྱབ་ལ་གྲངས་མེད་པ་མཆོག་ཏུ་བྱ་བས་མཆོད་ནས་མ་མ་དྲི་མ་མེད་པ་སྐྱེད་པའི་འོད་ཀྱི་པང་དུ་བཞག་གོ །མ་མ་དེས་བྱང་ཆུབ་སེམས་དཔའ་པང་དུ་བླངས་མ་ཐག་ཏུ།
en: They made countless inconceivable, supreme appropriate offerings to him and placed him on the nurse Vimala­saṃbhava­prabhā’s lap.
